lectures/vscode/vscode_lecture0.org
#+TITLE: $\mathrm{\LaTeX}$ in VS Code
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS:  num:nil


* Introduction
  - Nowadays most mathematicians use $\mathrm{\LaTeX}$. Since it is quite a
    straightforward software to use, one may not think much about how to write
    $\mathrm{\LaTeX}$ more efficiently. In this course I will walk you through
    how to use $\mathrm{\LaTeX}$ in VS Code. This course is targeted for those
    who already know how to write $\mathrm{\LaTeX}$ but want to improve their
    efficiency. I'll teach you only the basics. I hope that after this
    course you can explore and enjoy more interesting and advanced techniques in
    your own.
  - [[./flyer_vscode.pdf][Poster]]
* Lecture 1
  - We learn basics on VS Code and LaTeX Workshop.
  - [[./vscode_lecture1.html][Lecture Notes]], [[./vscode_lecture1(slides).html][Slides]], [[https://youtu.be/aSdGb47jJtc][Video (in Korean)]]
  - Preparations for Lecture 1
    - Install VS Code: https://code.visualstudio.com/
    - Download [[file:vscode-lecture-files.zip][this file]] and extract it somewhere in your computer.

* Lecture 2
  - We learn BibTeX and Vim. 
  - [[./vscode_lecture2.html][Lecture Notes]]
  - Prepartion for Lecture 2
     - Install JabRef: http://www.jabref.org/

* Lecture 3
  - We learn Git and GitHub for version control and collaboration. 
  - [[./vscode_lecture3.html][Lecture Notes]]
** Preparations for Lecture 3
*** Installing Git
    - Mac
      - Type the following in your terminal will install Git if you don't have it already.
        : git --version
      - See the instruction [[https://git-scm.com/book/en/v2/Getting-Started-Installing-Git][here]] if it doesn't work.
    - Windows
      - Download "64-bit Git for Windows Setup" (or 32-bit depending on your
         machine) [[https://git-scm.com/download/win][here]].
      - Install Git using default settings.
      - Restart your computer.
*** Signing up GitHub
    - Sign up here https://github.com/
*** Find a partner to practice Git together.
    - If you want me to find someone for you, send me an email at this address:
      jangsookim@skku.edu
