lectures/vscode/vscode_lecture0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-03 Thu 22:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>\(\mathrm{\LaTeX}\) in VS Code</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jang Soo Kim" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">\(\mathrm{\LaTeX}\) in VS Code</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org123f885">Introduction</a></li>
<li><a href="#org405135b">Lecture 1</a></li>
<li><a href="#org1e56b54">Lecture 2</a></li>
<li><a href="#orgb7954a2">Lecture 3</a>
<ul>
<li><a href="#org14c59e8">Preparations for Lecture 3</a>
<ul>
<li><a href="#orgcf56365">Installing Git</a></li>
<li><a href="#orgda3317c">Signing up GitHub</a></li>
<li><a href="#org5125605">Find a partner to practice Git together.</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org123f885" class="outline-2">
<h2 id="org123f885">Introduction</h2>
<div class="outline-text-2" id="text-org123f885">
<ul class="org-ul">
<li>Nowadays most mathematicians use \(\mathrm{\LaTeX}\). Since it is quite a
straightforward software to use, one may not think much about how to write
\(\mathrm{\LaTeX}\) more efficiently. In this course I will walk you through
how to use \(\mathrm{\LaTeX}\) in VS Code. This course is targeted for those
who already know how to write \(\mathrm{\LaTeX}\) but want to improve their
efficiency. I'll teach you only the basics. I hope that after this
course you can explore and enjoy more interesting and advanced techniques in
your own.</li>
<li><a href="./flyer_vscode.pdf">Poster</a></li>
</ul>
</div>
</div>
<div id="outline-container-org405135b" class="outline-2">
<h2 id="org405135b">Lecture 1</h2>
<div class="outline-text-2" id="text-org405135b">
<ul class="org-ul">
<li>We learn basics on VS Code and LaTeX Workshop.</li>
<li><a href="./vscode_lecture1.html">Lecture Notes</a>, <a href="./vscode_lecture1(slides).html">Slides</a>, <a href="https://youtu.be/aSdGb47jJtc">Video (in Korean)</a></li>
<li>Preparations for Lecture 1
<ul class="org-ul">
<li>Install VS Code: <a href="https://code.visualstudio.com/">https://code.visualstudio.com/</a></li>
<li>Download <a href="vscode-lecture-files.zip">this file</a> and extract it somewhere in your computer.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1e56b54" class="outline-2">
<h2 id="org1e56b54">Lecture 2</h2>
<div class="outline-text-2" id="text-org1e56b54">
<ul class="org-ul">
<li>We learn BibTeX and Vim.</li>
<li><a href="./vscode_lecture2.html">Lecture Notes</a></li>
<li>Prepartion for Lecture 2
<ul class="org-ul">
<li>Install JabRef: <a href="http://www.jabref.org/">http://www.jabref.org/</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb7954a2" class="outline-2">
<h2 id="orgb7954a2">Lecture 3</h2>
<div class="outline-text-2" id="text-orgb7954a2">
<ul class="org-ul">
<li>We learn Git and GitHub for version control and collaboration.</li>
<li><a href="./vscode_lecture3.html">Lecture Notes</a></li>
</ul>
</div>
<div id="outline-container-org14c59e8" class="outline-3">
<h3 id="org14c59e8">Preparations for Lecture 3</h3>
<div class="outline-text-3" id="text-org14c59e8">
</div>
<div id="outline-container-orgcf56365" class="outline-4">
<h4 id="orgcf56365">Installing Git</h4>
<div class="outline-text-4" id="text-orgcf56365">
<ul class="org-ul">
<li>Mac
<ul class="org-ul">
<li><p>
Type the following in your terminal will install Git if you don't have it already.
</p>
<pre class="example">
git --version
</pre></li>
<li>See the instruction <a href="https://git-scm.com/book/en/v2/Getting-Started-Installing-Git">here</a> if it doesn't work.</li>
</ul></li>
<li>Windows
<ul class="org-ul">
<li>Download "64-bit Git for Windows Setup" (or 32-bit depending on your
machine) <a href="https://git-scm.com/download/win">here</a>.</li>
<li>Install Git using default settings.</li>
<li>Restart your computer.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgda3317c" class="outline-4">
<h4 id="orgda3317c">Signing up GitHub</h4>
<div class="outline-text-4" id="text-orgda3317c">
<ul class="org-ul">
<li>Sign up here <a href="https://github.com/">https://github.com/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5125605" class="outline-4">
<h4 id="org5125605">Find a partner to practice Git together.</h4>
<div class="outline-text-4" id="text-org5125605">
<ul class="org-ul">
<li>If you want me to find someone for you, send me an email at this address:
jangsookim@skku.edu</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jang Soo Kim</p>
<p class="date">Created: 2020-12-03 Thu 22:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
